{"response": {"status": {"version": "4.2", "code": 0, "message": "Success"}, "start": 0, "total": 11, "biographies": [{"text": "Cher (born Cherilyn Sarkisian on May 20, 1946, later adopted by Gilbert LaPierre.) is an American singer, actress, songwriter, author and entertainer. Among her many career accomplishments in music, television and film, she has won an Academy Award, a Grammy Award, an Emmy Award and three Golden Globe Awards among others.  Referred to as the Goddess of Pop, Cher first rose to prominence in 1965 as one half of the pop/rock duo Sonny & Cher. She also established herself as a solo recording artist, releasing 25 albums, contributing to numerous compilations, and tallying 34 Billboard Top 40 entries over her career, both solo and with Sonny. These include eighteen Top 10 singles and five number one singles (four solo). Cher has had 16 top ten hits in the UK between 1965 and 2003, four of which reached number one (two solo, one with Sonny, one as part of a charity single).  In a career surpassing 40 years, Cher has been described as an enduring pop icon and one of the most popular female artists in music history. Since her debut in 1964, Cher has sold as a solo artist over 180 million records worldwide and an estimated 70 million singles and with duo Sonny and Cher over 80 million records becoming one of the biggest-selling artists of all time.  She became a television star in the 1970s and a film actress in the 1980s. In 1987, she won the Academy Award for Best Actress for her role in the romantic comedy Moonstruck.  During 2007, in the seventh volume of Chrome Hearts, Cher once again confirmed that she is working on her twenty-sixth studio album. No recordings have taken place as of yet, and no release date had been scheduled.  It is rumoured that Cher will collaborate with Lady Gaga in a song for her next album Born This Way. This album is expected to be released in Spring 2011.  On February 7, 2008 Cher, at 61, announced that she had reached a deal to perform 200 shows over three years live at the Colosseum at Caesar's Palace in Las Vegas. Her new show, entitled Cher at the Colosseum, debuted on May 6, 2008. The show reportedly includes 18 dancers, 4 aerialists, and multiple costumes designed by Bob Mackie. Choreography will be directed by Doriana Sanchez who also worked with Cher on her past three major tours. Her show will perform four nights a week for a month, and a second leg of the show will continue in August. Cher will share the stage on a rotating basis with contemporaries Bette Midler (whose The Showgirl Must Go On opened on February 20, 2008) and Elton John (whose The Red Piano which opened in 2004, will continues its run of about 50 shows a year).  Cher made her musical debut and first film role in a decade in Burlesque, starring alongside Christina Aguilera, who also made her musical and film debut. The film was released in November 2010.", "site": "last.fm", "url": "http://www.last.fm/music/Cher/+wiki", "license": {"type": "cc-by-sa", "attribution": "Last.fm", "attribution-url": "http://www.last.fm/music/Cher/+wiki", "url": "http://creativecommons.org/licenses/by-sa/3.0/", "version": "3.0"}}, {"text": "Cher has had three careers that place her indelibly in ...", "site": "aol", "url": "http://music.aol.com/artist/cher/biography", "license": {"type": "unknown", "attribution": "aol", "attribution-url": "http://music.aol.com/artist/cher/biography", "url": "n/a", "version": "unknown"}, "truncated": true}, {"text": "Cher has had three careers that place her indelibly in ...", "site": "mog", "url": "http://mog.com/artists/bio/mn5721/cher", "license": {"type": "all-rights-reserved", "attribution": "mog", "attribution-url": "http://mog.com/artists/bio/mn5721/cher", "url": "n/a", "version": "unknown"}, "truncated": true}, {"text": "But people don't simply \"like\" Cher. More than 40 years ...", "site": "myspace", "url": "http://www.myspace.com/cherconquerstheworld", "license": {"type": "unknown", "attribution": "myspace", "attribution-url": "http://www.myspace.com/cherconquerstheworld", "url": "n/a", "version": "unknown"}, "truncated": true}, {"text": "American actress/singer whose career stretches back to the 1960s. She ...", "site": "discogs", "url": "http://www.discogs.com/artist/Cher", "license": {"type": "public-domain", "attribution": "n/a", "attribution-url": "http://www.discogs.com/artist/Cher", "url": "n/a", "version": "unknown"}, "truncated": true}, {"text": "Cher has had three careers that place her indelibly in ...", "site": "itunes", "url": "http://itunes.apple.com/us/artist/cher/id106158", "license": {"type": "unknown", "attribution": "itunes", "attribution-url": "http://itunes.apple.com/us/artist/cher/id106158", "url": "n/a", "version": "unknown"}, "truncated": true}, {"text": "Cher ( /ˈʃɛər/; born Cherilyn Sarkisian on May 20, 1946) is an American recording artist, Emmy Award-winning television personality, award-winning actress, director, record producer and philanthropist. Referred to as the Goddess of Pop, she has won an Academy Award, a Grammy Award, an Emmy Award, three Golden Globes and a Cannes Film Festival Award among others for her work in film, music and television. She is the only person in history to have received all of these awards. Cher began her career as a backup singer and later came to prominence as one half of the pop rock duo Sonny & Cher with the success of their song \"I Got You Babe\" in 1965. She subsequently established herself as a solo recording artist, and became a television star in 1971 with The Sonny and Cher Comedy Hour, a variety show for which she won a Golden Globe. A well received performance in the film Silkwood earned her a nomination for the Academy Award for Best Supporting Actress in 1984. In the following years, Cher starred in a string of hit films including Mask, The Witches of Eastwick, and Moonstruck, for which she won the Academy Award for Best Actress in 1988. Cher, throughout a career spanning over six decades, has broken many records. She is the only artist to reach number one on the Billboard charts in each of the previous six decades, and also holds this record for four and five decades. Her hit dance single \"Believe\" is her biggest-selling recording and was the best-selling single of 1999, having sold over 10 million copies worldwide. She holds the Hot 100 record for the longest hit-making career span, with 33 years between the release of her first and most recent Billboard Hot 100 #1 singles, in 1965 and 1999 and 45 years between her first and most recent #1 ranking on any Billboard chart Cher ended her 3-year-long \"Farewell Tour\" in 2005 as the most successful tour by a female solo artist of all time. With a career lasting over 45 years, Cher has sold over 100 million records worldwide. After a three-year hiatus and retirement from touring, Cher returned to the stage in February 2008 at Caesars Palace in Las Vegas where she performed her show Cher at the Colosseum until February 2011. Cher has a deep contralto vocal range. Early life, Cher was born Cherilyn Sarkisian in El Centro, California, on May 20, 1946, at 7:25 a.m. Her father, John Paul Sarkisian, was Armenian American and worked as a truck driver. Her mother, Georgia Holt (born Jackie Jean Crouch in Sharp County, Arkansas on June 9, 1927), an aspiring actress and occasional model, is of Cherokee, English, and French descent. Cher's half sister is actress Georganne LaPiere. Cher's parents divorced and she was raised primarily by her mother, who at one time was married to Gilbert LaPiere, a banker who adopted Cher. Due to financial problems, Cher's mother temporarily placed her in foster care. Later, her mother provided money for acting lessons to help further her career. Due to severe, undiagnosed dyslexia, she left Fresno High School at age 16. In those years, Cher had a brief relationship with actor Warren Beatty. Career, 1962-1964: Early career: Sonny Bono, 11 years her senior, was working for record producer Phil Spector at Gold Star Studios in Hollywood. Sonny and Cher became inseparable friends, eventual lovers, and later married. Through Sonny, Cher started as a session singer in 1963, and sang backup on several of Spector's classic recordings, including The Righteous Brothers' \"You've Lost That Loving Feeling\", Darlene Love's \"A Fine, Fine Boy,\" The Crystals' \"Da Doo Ron Ron\" and The Ronettes' \"Be My Baby\". In the composition by Darlene Love, the listener can clearly hear Cher and Sonny close to the microphone (along with Love, who recorded her own backing vocals). Her first solo recording was the unsuccessful single \"Ringo, I Love You\", released under the pseudonym of Bonnie Jo Mason and produced by Phil Spector. Her second attempt was \"Dream Baby,\" released under the name \"Cherilyn\" and written and produced by Sonny Bono. Both were released in 1964. With Sonny continuing to write, arrange and produce the songs, Sonny and Cher's first incarnation was as the duo \"Caesar and Cleo.\" They received little attention, despite releasing the single \"The Letter\" in late 1964. 1965-1969: Career development: Before being known as Sonny and Cher, the duo released an album under the name of \"Caesar and Cleo.\" The first \"Sonny and Cher\" album, Look At Us, was released in the summer of 1965. This album contained the overnight smash single \"I Got You Babe\" which reached #1 on the Billboard Hot 100 in August 1965. Cher was 19 years old, Sonny 30. A re-released \"Baby Don't Go\" peaked at #8. Several more mid-level hits followed, notably \"Just You,\" \"But You're Mine\", \"What Now My Love\" and \"Little Man\", before \"The Beat Goes On\" returned the duo to the Top 10. Sonny and Cher charted eleven Billboard Top 40 hits between 1965 and 1972, including six Top 10 hits. The duo became a sensation, traveling and performing around the world. Following an appearance on The Ed Sullivan Show in the fall of 1965 in which Sullivan had infamously mispronounced her name 'Chur' during their introduction, the singer began spelling her name with an acute accent mark: Chér--a typographical feature she maintained through 1974. The couple soon appeared on other hit television shows of the era including American Bandstand, Top of the Pops, Hollywood A Go-Go, Podunk, Hollywood Palace, Hullabaloo, Beat Club, Ready Steady Go! and Shindig!!. While initially perceived as the slightly awkward and less important half of the popular singing duo, Cher disguised her stage fright and nervousness with quick-witted barbs directed at her partner. She soon rose to prominence as the more outspoken, daring and provocative half of the team. With her dark, exotic looks, she became a fashion trendsetter, helping to popularize fashions such as bellbottoms and incorporating eccentric gowns, \"hippie\" attire and elaborate costumes into live shows. Later in 1965, Cher released her debut solo album, All I Really Want to Do, which reached #16 on the Billboard 200 album chart. The album's cover of the Bob Dylan song \"All I Really Want to Do\" peaked at #15 on the Billboard Hot 100. In 1966, Cher released her second solo album on the Imperial Records label, The Sonny Side of Chér. It peaked at #26 in the US charts, and #11 in the UK chart. The album contained the singles \"Where Do You Go (#25 on the Billboard Hot 100), as well as \"Bang Bang (My Baby Shot Me Down)\" (#2 on the Billboard Hot 100); both hits written and produced by Sonny Bono. In the United States, the latter was Cher's biggest solo hit of the 1960s. Her third solo album Chér, also released in 1966, was not as successful as its predecessors, but did include the European Top 10 hit \"Sunny\". In an attempt to capitalize on the duo's initial success, Sonny speedily arranged a film project for the duo to star in. But the 1967 feature, Good Times, was a major bomb, despite the efforts of fledgling director William Friedkin and co-star George Sanders. Cher continued to establish herself as a solo artist and released the album Backstage. The album was a flop. Sonny and Cher's career had stalled by 1968 as album sales dried up. Their gentle, easy-listening rock folk sound and drug-free life had become \"unhip\" in an era becoming increasingly consumed with psychedelic rock, and the overall evolutionary change in the American pop culture landscape during the late 1960s. Sonny and Cher's only child together, Chaz Bono, was born Chastity Bono on March 4, 1969. The duo made another unsuccessful foray into film later in 1969 with Bono writing and producing the film Chastity, intended as a dramatic debut for Cher as an actress. That film (directed by first and only-time director Alessio De Paulo) was also a commercial failure. Sonny decided to forge ahead, carving a new career for the duo in Las Vegas resorts, where they sharpened their public persona with Cher as the wise-cracking singer, and Sonny as the good-natured recipient of her insults. In reality, Sonny controlled every aspect of their act, from the musical arrangements to the joke-writing. While success was slow to come, their luck improved when network TV talent scouts attended a show, noting their potential appeal for a variety series. 1970-1975: TV and musical stardom: In 1970, Sonny and Cher starred in their first television special, The Sonny and Cher Nitty Gritty Hour. A mixture of slapstick comedy, skits and live music, the appearance was a critical success, which led to numerous guest spots on other television shows. Sonny and Cher caught the eye of CBS head of programming Fred Silverman while guest-hosting The Merv Griffin Show, and Silverman offered the duo their own variety show.The Sonny and Cher Comedy Hour debuted in 1971 as a summer replacement series. The show returned to prime time later that year and was an immediate hit, quickly reaching the Top 10. The show received 15 Emmy Award nominations during its run, winning one for direction. Among the many guests who appeared on The Sonny and Cher Comedy Hour were Tina Turner, Chuck Berry, Carol Burnett, George Burns, Glen Campbell, Dick Clark, Tony Curtis, Bobby Darin, Phyllis Diller, Farrah Fawcett, Merv Griffin, The Jackson Five, Jerry Lee Lewis, Liberace, Steve Martin, Ronald Reagan, Burt Reynolds, Lynn Anderson, The Righteous Brothers, Neil Sedaka, Dinah Shore, Sally Struthers, The Supremes, and Raquel Welch. The duo revived its recording career, releasing four more albums for Kapp Records and MCA Records that included two more Top 10 hits: \"All I Ever Need Is You\" in 1971, and \"A Cowboy's Work Is Never Done\" in 1972. \"Gypsys, Tramps & Thieves\"\"Gypsys, Tramps & Thieves\" became Cher's first number one song, reaching number one in Canada and the US. Problems listening to this file? See media help. Now 25, Cher continued to establish herself as a solo recording artist, enlisting the help of hit producer Snuff Garrett. Her first solo number-one hit was \"Gypsys, Tramps & Thieves\". Released in September 1971, the album of the same name peaked at #16 on the Billboard 200, and remained on the chart for 45 weeks. Another single from the album, \"The Way of Love\" peaked at #7 in March 1972. Cher scored her second number one with \"Half-Breed\" in 1973 which became a signature song from the gold-certified album of the same name. In 1974, Cher had her third #1 solo hit with \"Dark Lady\", also from the album of the same name. By the third season of the Sonny and Cher Comedy Hour, the marriage of Sonny and Cher was falling apart; the duo separated later that year. The show imploded, while still in the top 10 of the ratings. What followed was a nasty, very public divorce (finalized on June 27, 1975). Cher won a Golden Globe Award for Best Performance By an Actress in a Television Series - Musical or Comedy for The Sonny and Cher Comedy Hour in 1974. Bono launched his own show, The Sonny Comedy Revue, in the fall of 1974 while Cher also announced plans to host and star in a new variety TV series of her own. Bono's show was abruptly canceled, however, after only six weeks. The couple would eventually reunite for two more seasons of their show.The Cher Show debuted as an elaborate, all-star television special on February 16, 1975 featuring Flip Wilson, Bette Midler and special guest Elton John.Cloris Leachman and Jack Albertson both won Emmy Awards for their appearances as guest stars a few weeks later, and the series received four additional Emmy nominations that year. Other guests included Pat Boone, David Bowie, Ray Charles, Dion, Patti Labelle, Cheryl Ladd, Wayne Newton, Linda Ronstadt, Lily Tomlin and Frankie Valli. The variety series' debut season ranked 22nd in the year-end Nielsen ratings. A good deal of press was generated throughout 1975 regarding Cher's exposed navel and the daring ensembles created by famed designer Bob Mackie. Her show featured numerous outlandish costume changes, even more than typical variety shows. The Cher show ran for two half-seasons, before a pregnant Cher pulled the plug herself, deciding instead to reunite with her ex-husband for a revamped version of The Sonny and Cher Comedy Hour. Three days after finalizing her divorce from Sonny, Cher married rock musician Gregg Allman, a founding member of the Allman Brothers Band, on June 30, 1975. They had one son, Elijah, in July 1976. Together, they released the album, Two the Hard Way, under the rubric Allman and Woman, which featured a cover of the Smokey Robinson hit \"You've Really Got a Hold on Me\". This project was not considered a critical or commercial success. They were divorced after two years of marriage. 1976-1981: Solo career and misses: From 1975 to 1978, Cher released a series of unsuccessful albums: Stars, I'd Rather Believe in You and Cherished. On February 2, 1976, The Sonny and Cher Show debuted with a Top 10 rating and high expectations. Some of the guests who appeared on The Sonny and Cher Show included Frankie Avalon, Muhammed Ali, Raymond Burr, Ruth Buzzi, Charo, Barbara Eden, Farrah Fawcett, Terri Garr, Bob Hope, Don Knotts, Jerry Lewis, Tony Orlando, The Osmonds, Debbie Reynolds, The Smothers Brothers, Tina Turner, Twiggy, and Betty White. However, ratings soon fell, and the show was cancelled after its second season. In 1976, Mego Toys released a line of toys and dolls in the likeness of Sonny & Cher. The release of these fashion dolls coincided with the popularity of The Sonny & Cher Show. Their overall television success, though brief, was unique because variety programming in general, other than The Carol Burnett Show, was no longer attracting viewers. She made a brief return to prime time starring in the television specials Cher... Special, in 1978 (for which guest star Dolly Parton was nominated for an Emmy Award) and Cher ... and Other Fantasies in 1979. One highlight for her fans was a song and dance number based on the classic musical West Side Story in which Cher portrayed each of the main characters. In 1978, she legally changed her name from Cherilyn Sarkisian La Piere Bono Allman to Cher, with no surname or middle name. Heidi Stevens of the Chicago Tribune said Cher was \"tired of being saddled with surnames of her father, stepfather and ex-husbands.\" Sonny and Cher performed together for the last time on The Mike Douglas Show in the spring of 1979 (until their much-discussed 1987 Letterman appearance), singing a medley of \"United We Stand\" and \"Without You\". Later in 1979, Cher would capitalize on the disco craze, signing with Casablanca Records, and racking up another Top-10 single with \"Take Me Home\". Sales of the album Take Me Home may have been boosted by the image of a scantily-clad Cher in a Viking outfit on the album's cover. The album was RIAA-certified Gold. For her second Casablanca release, Prisoner, Cher appeared on the album's cover virtually naked and wrapped in chains, spurring controversy among some women's rights groups for her perceived \"sex slave\" image. This album produced the minor hit single \"Hell on Wheels\" and the tune was also featured in the film Roller Boogie. In 1980, Cher penned her last disco song for the film Foxes, called \"Bad Love.\" Later in the same year, Cher formed the rock band Black Rose with her then-partner, guitarist Les Dudek, and released the album Black Rose. The album failed to sell, despite an appearance on The Tonight Show Starring Johnny Carson, and the band broke up the following year. In 1981, Cher released her first Top 5 hit in UK in ten years: \"Dead Ringer for Love\", a duet with Meat Loaf for his album Dead Ringer. In 1982, Cher released I Paralyze, promoting it on American Bandstand and The Tonight Show, but critics panned the album and sales were disappointing. 1982-1987: Film stardom and musical breakout: With album sales and hit singles again at a standstill, Cher decided to expand her career into serious film acting. Her earliest entertainment ambitions had always lain in film, as opposed to music. Her earlier films, like Good Times and Chastity, had been poorly received. She soon found herself in an uphill battle trying to land credible roles for a woman now in her mid-30s with little acting experience. At the time, she was quoted as saying that she did not really care if she ever made another record. In 1982, Cher landed her first major role in a Broadway production of Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean. That same year, she was cast in the film version, which was directed by Robert Altman and earned her a Golden Globe nomination. She was next cast alongside Meryl Streep and Kurt Russell in the drama Silkwood (1983) in which she played Streep's blue-collar lesbian roommate. She received her first Academy Award nomination, as Best Supporting Actress. She also won the Golden Globe Award for Best Supporting Actress - Motion Picture for her performance. Cher's next film was a starring role in Mask in 1985, directed by Peter Bogdanovich. The film also starred Eric Stoltz, Laura Dern, Estelle Getty and Sam Elliott. It opened at #3 at the box office and was considered her first critical and commercial success as a leading actress. For her role as a mother of a severely disfigured boy, Cher won the Best Actress prize at the Cannes Film Festival and received a Golden Globe nomination for Best Actress in a Motion Picture Drama. In 1985, Cher was honored with Harvard University's Hasty Pudding Woman of the Year Award. On May 22, 1986, Cher made her first appearance on Late Night with David Letterman. In her pre-interview with the show's producers, Cher had referred to host David Letterman with a derogatory term when asked why she had previously declined to appear on his program. He later confronted her about this on air during their interview, asking why she had refused so many earlier invitations. As she thought of an appropriate answer, he pushed her further saying, \"Because you thought...\" to which she replied \"You were an asshole. She received a mixture of boos and laughter from the audience for the remark; however, Letterman quickly played off the incident as just fun. Cher returned to Late Night With David Letterman in an appearance on November 13, 1987, this time with ex-husband Sonny Bono, reuniting to sing \"I Got You, Babe\" for what would be the last time. She has since made multiple appearances on Letterman's CBS show. In 1987, Cher starred in three films. She was cast as Alexandra, the female lead in the dark comedy/fantasy film The Witches of Eastwick with Jack Nicholson, Susan Sarandon and Michelle Pfeiffer. She played a lawyer in the thriller Suspect opposite Dennis Quaid, and starred in the romantic comedy Moonstruck, which co-starred Nicolas Cage and Olympia Dukakis and was directed by Norman Jewison. For her performance as a frumpy bookkeeper in Moonstruck, she won the 1987 Academy Award for Best Actress. She also won the Golden Globe Award for Best Actress in a Musical/Comedy, and the People's Choice Award for Favorite Female Star. 1987-1989: Return to musical success: In 1987, Cher revived her recording career after a five-year hiatus, under the coordination of rock producer and A&R man John Kalodner. Now with Geffen Records, Cher released the first of three highly successful rock albums, featuring songwriting contributions from the likes of Diane Warren, Jon Bon Jovi, Richie Sambora, Desmond Child, Mark Mangold and Michael Bolton.Darlene Love and Bonnie Tyler provided guest vocals.Cher was released in 1987, and featured the comeback single \"I Found Someone\" written by Michael Bolton and Mark Mangold (previously a minor hit for Laura Branigan), as well as \"We All Sleep Alone\" (#14, 1988). The album was a big hit, being certified Platinum in the US and selling seven million copies worldwide. In 1987, she also released her first fragrance, Uninhibited. In 1989, Cher released the album Heart of Stone. As on her previous album, Michael Bolton, Jon Bon Jovi, Diane Warren and Desmond Child handled songwriting and/or producing duties. The album was originally released with cover artwork featuring Cher sitting in front of a heart made of stone, creating the illusion of a skull.Heart of Stone would prove to be very successful, having sold 11,000,000 copies worldwide, and certified 3x Platinum by the RIAA. The album's biggest hit came with the rock hymn \"If I Could Turn Back Time\", which topped the charts in Australia for seven non-consecutive weeks, peaked at #3 in the US, reached #6 in the UK and charted in various other countries around the globe. Further hits from the album were \"Just Like Jesse James\", \"Heart of Stone\", and it also contained the hit duet with Peter Cetera, \"After All\", #6 in US. \"If I Could Turn Back Time\"\"If I Could Turn Back Time\" was a big hit, reaching the top spot in Australia and the top 10 in the US, UK and Canada. Problems listening to this file? See media help. The video for \"If I Could Turn Back Time\" caused controversy, because in it Cher wore a skimpy, see-through net outfit, which revealed a \"butterfly\" tattoo on her buttocks. Many networks on television, including MTV, initially refused to air the video because of the \"partial nudity\". MTV network eventually played the video, but only after 9 p.m. Cher launched the Heart of Stone Tour, which played throughout 1989 and 1990 in various parts of the world. She also starred in the television special Cher - Live at the Mirage, which was filmed during a live concert in Las Vegas. In the late 1980s, Cher was considered for the role of the Grand High Witch in a movie adaptation of Roald Dahl's novel The Witches, but the role was eventually given to Anjelica Huston. 1990-1992: Artistic development and commercial hits: In 1990, Cher starred in the modest box office success Mermaids with Bob Hoskins, Winona Ryder, and Christina Ricci. The film received many positive reviews from critics. Cher contributed two songs to its soundtrack. \"Baby I'm Yours\" and the album's second single, \"The Shoop Shoop Song (It's in His Kiss)\", charted low on the US Billboard Hot 100 (at #33), but became a smash hit elsewhere, reaching #1 in the UK, #3 in Germany and France, and #5 in Australia. Around the globe, it became her most successful single to date, selling more than six million copies worldwide. In 1991, Cher completed her Geffen recording contract by releasing the album Love Hurts. This album had a big impact in Europe and in the rest of the world, particularly in the UK where it debuted at #1 and stayed there for six consecutive weeks. Unlike her previous two records, Love Hurts received less attention in the United States where it was certified gold; in European countries, the album was certified multi-platinum. The European cover of the album was different from the American release, featuring Cher lying on a white background wearing a red wig. The European release also included the worldwide hit \"The Shoop Shoop Song (It's in His Kiss)\". The album also sparked another hit single, \"Love and Understanding\", a number 10 hit in UK as well as the album's only major hit in her native US, entering the Top 20. The follow-ups \"Save Up All Your Tears\", \"Love Hurts\", and \"Could've Been You\" were minor hits in Europe. The album Love Hurts has sold more than 14 million copies worldwide becoming her 2nd biggest-selling album of her career. In Germany, Cher received the prestigious ECHO award for the most successful female singer of the year. Cher embarked on the Love Hurts Tour throughout 1992. In the same period Cher released two VHS fitness programs, Cherfitness: A New Attitude and Cherfitness: A Body Confidence. In 1992, the European compilation Greatest Hits: 1965-1992 became a huge success, again peaking at #1 in the United Kingdom for seven non-consecutive weeks, and charting in the Top 10 in several other countries. The album, which contained three newly-recorded tracks (\"Oh No Not My Baby\", \"Many Rivers to Cross\" and \"Whenever You're Near\") was available in the United States only as an import. The album has sold 4.9 million copies world-wide. 1992-1997: Commercial ups-and-downs, controversy and death of Sonny Bono: \"One by One\"A success from the It's A Man's World album, reached the top 10 in the UK and some of the Billboard charts. Problems listening to this file? See media help. In 1992, Cher took some time off, following what was widely reported as a case of Epstein-Barr virus or chronic fatigue syndrome. She made few public appearances during this period with the exception of appearing in a series of infomercials launching hair-care products for her friend Lori Davis, and for the sweetener Equal. Cher made cameo appearances in the Robert Altman films The Player (1992) and Prêt-à-Porter (1994). In 1994, she collaborated with MTV's cartoons Beavis and Butt-head for a rock version of Sonny & Cher's \"I Got You Babe\". The next year she and Chrissie Hynde, Neneh Cherry and Eric Clapton topped the UK Singles Chart for one week with the charity single \"Love Can Build a Bridge\". In 1995, she recorded an album, mainly of covers, titled It's a Man's World. The album was released in Europe at the end of 1995 and in North America in the summer of 1996. The album sparked two European hits: \"Walking in Memphis\" and \"One by One\". It's a Man's World was a moderate success, with six million copies worldwide; however, sales in the United States were limited. Cher starred in Faithful (1996) with Ryan O'Neal and Chazz Palminteri, and scored a minor comeback when she co-executive-produced and appeared in the highly anticipated, controversial HBO abortion drama If These Walls Could Talk, with Demi Moore, Sissy Spacek and Anne Heche. Nancy Savoca co-wrote all three segments and directed the first two sections starring Moore and Spacek, but Cher directed and co-starred in the third segment, earning a Golden Globe Nomination as Best Supporting Actress in a made-for-television movie. Cher was in London in January 1998 when a call from daughter Chastity brought news of Sonny Bono's death in a skiing accident. He was 62. At the time of his death, Bono, by then a popular California Congressman, was married to his fourth wife, Mary Bono. Sonny and Cher had been divorced for nearly 23 years and he was remarried with two more children. However, the two had remained friendly over the years, and she was chosen to deliver Sonny's eulogy at his funeral. In front of a worldwide television audience, she tearfully and effusively praised Bono, calling him \"the most unforgettable character I've ever met.\" Cher paid tribute to Bono in the CBS special Sonny and Me: Cher Remembers (1998), calling her grief \"something I never plan to get over.\" In 1998, Sonny & Cher received a star on the Hollywood Walk of Fame for Television. Cher appeared at the event with Mary Bono, who accepted the award on behalf of her late husband. 1998-2000: Popularity of Believe: Cher's 23rd studio album, 1998's Grammy Award-winning Believe marked an extreme departure for Cher, as the record was a collection of up-tempo dance tracks. The album was a critical and commercial success, reaching the top spot in nearly every country where it was released, including the United States, Germany, Australia and France. Believe has been certified 4x Platinum in the United States and has sold 20 million copies worldwide. The Grammy Award-winning first single and title track was a worldwide smash, easily becoming the biggest hit of Cher's entire career. By March 1999, the song reached #1 in 23 countries around the world including the United States, the United Kingdom, Germany, France and Australia. It was the best-selling recording of the year. \"Believe\" made Cher the oldest woman (at age 52) to have a number one hit in the Hot 100 rock era. It also gave her the distinction of having the longest span of #1 hits (more than 33 years) and the largest gap between number ones (10 days short of 25 years). Cher is also the only female artist to have solo Top 10 hits in the 1960s, 1970s, 1980s, 1990s and 2000s. On the UK Singles Chart, \"Believe\" claimed the number one slot for seven consecutive weeks, and also became the biggest-selling single ever by a female artist in the United Kingdom. It sold over 10 million copies worldwide. From the album, three other singles were released, with \"Strong Enough\" becoming a perfect follow-up hit in Europe, peaking at #3 in Germany and France as well as the UK Top Five, but failing to gain equally huge success in North America. \"All or Nothing\" and \"Dov'è l'amore\" were also solid hits in Europe, but did not get much attention in her native country. Cher published her first memoir in late 1998, titled The First Time. Rather than a tell-all, the book was a collection of Cher's most significant \"first-time\" memories from her childhood, life and Hollywood career. In January 1999, Cher performed \"The Star-Spangled Banner\" in front of the Super Bowl XXXIII television audience. Cher also performed on the highly rated television special VH1 Divas Live 2, performing alongside contemporaries Tina Turner, Elton John, Chaka Khan, Faith Hill, Mary J. Blige, LeAnn Rimes, Diana Ross, Brandy and Whitney Houston. Later in 1999, Cher co-starred in the well-received Franco Zeffirelli film Tea With Mussolini (1999) with Judi Dench, Maggie Smith, Joan Plowright and Lily Tomlin. Her successful worldwide Do You Believe? Tour travelled throughout the United States, Canada, and Europe, with the Emmy-nominated television special Cher: Live at the MGM Grand In Las Vegas airing by year's end. On November 30, 1999, she released a compilation album The Greatest Hits that continued to build upon her huge popularity in Europe. The album entered the German Charts at #1 (her second consecutive German No. 1 album) and peaked at #7 on the official UK Albums Chart. This compilation was only released outside the United States, due to the release of the North American only compilation, If I Could Turn Back Time: Cher's Greatest Hits which was released that same year. In Germany she again became best selling female artist of the year and was receiving her second ECHO Award (she and Madonna are the only female artists to do so). The Do You Believe? Tour continued throughout 2000 and became her most successful tour to that time. 2000-2002: Legacy of achievement: In May 2000, Cher was presented with the Lifelong Contribution to the Music Industry Award, at the World Music Awards. She released an independent alternative-rock album titled Not.com.mercial (pronounced \"not-dot-com-mercial\"). This album was written mostly by Cher after attending a songwriting retreat in France in 1994. The album was quickly rejected by record labels for being \"not commercial.\" Cher chose instead to sell the recording exclusively through her website. This marked the first time that Cher had written a majority of the material for one of her albums. In an online review, Rolling Stone described \"Fit To Fly\", a Cher-penned track from the album, as \"the best Cher song ever.\" The tune was Cher's tribute to American veterans of war. On November 16, 2000, Cher also made a guest star appearance in the hit NBC TV series Will & Grace in the episode \"Gypsies, Tramps and Weed\" (Named after Cher's hit Gypsys, Tramps & Thieves). Also in 2000, she was awarded the Women in Film Lucy Award, along with the rest of the creators and cast of If These Walls Could Talk, for her work as a director and actor on segment 1996 of If These Walls Could Talk. The Lucy Award recognizes excellence and innovation in creative works that have enhanced the perception of women through the medium of television. In February 2002, still in a dance mode, Cher released the highly anticipated follow-up to Believe: Living Proof, which entered the Billboard 200 at number nine, making it her highest-charting album debut and extending her album-chart span to an excess of 37 years. It did not repeat the success of Believe, showing no longevity in the charts. Outside the United States, things were little better: in the United Kingdom, France and Australia, Living Proof failed to reach the Top 40, while charting best in Germany by entering at #13. The album included several re-mixed songs that found their way onto the Hot Dance, Maxi-Single Sales, Club Play and Adult Contemporary charts. The album was eventually certified gold in the United States and Germany, and earned her two Grammy nominations. That year, Cher won the Dance/Club Play Artist of the Year and was presented with a special Artist Achievement Award at the Billboard Music Awards. In May 2002, Cher performed on the VH1 television special VH1 Divas Las Vegas, with Shakira, Celine Dion, The Dixie Chicks, Anastacia, Cyndi Lauper and Mary J. Blige. In June, she announced plans for Living Proof: The Farewell Tour, which she claimed would be the final live concert tour of her career, though she vowed to continue recording and releasing music. 2002-2005: The Farewell Tour: The show itself was a tribute to her nearly 40 years in show business. It featured vintage performance and video clips from the 1960s onwards, highlighting her successes in music, television, and film, all set amongst an elaborate backdrop and stage set-up, complete with backing band, singers and dancers, including aerial acrobatics. Dates were added, and the tour was extended several times, covering virtually all of the US and Canada (plus three shows in Mexico City), several cities in Europe, as well as the major cities of Australia and New Zealand. Going well past its original cut-off date, it was eventually redubbed the \"Never Can Say Goodbye Tour\". In April 2003 The Very Best of Cher, a CD collection of all of her greatest hits spanning her entire career, was released. The album peaked at number four on the Billboard 200 album chart, extending her album chart span to over 38 years. The compilation has been certified double platinum and has sold 3.5 million copies worldwide. She found success on television once again in the spring of 2003 with Cher: The Farewell Tour Live, an NBC special taped on and November 7 and 8, 2002 at Miami's American Airlines Arena and aired in April 2003, attracting 17.3 million viewers. It earned Cher her first Emmy Award as Outstanding Variety, Music or Comedy Special. She released the album Live: The Farewell Tour later in 2003, a collection of live tracks taken from the tour. She was also seen, as herself, in the Farrelly Brothers comedy Stuck on You (2003) with Matt Damon and Greg Kinnear. In the film, she spoofed her own image, appearing in bed with a high-school boyfriend (Frankie Muniz). Also in 2003, Cher recorded a duet of \"Bewitched, Bothered and Bewildered\" for Rod Stewart's As Time Goes By... The Great American Songbook Volume II album. In February 2004, she received another Grammy Award nomination for Best Dance Recording for her song \"Love One Another\". During 2004, a Sonny & Cher DVD was released with nine Sonny & Cher shows from the famous Sonny and Cher Comedy Hour and The Sonny and Cher Show, featuring some of the best shows during the 1970s. In 2004, Cher released the album Gold, a 2-CD collection of all her greatest hits, spanning from her days as one-half of Sonny & Cher to her Living Proof era. It was only a year following the release of her multi-platinum The Very Best of Cher album, though Allmusic nevertheless gave it four and a half out of five stars. Cher closed the farewell tour in April 2005 at the Hollywood Bowl. It was the most successful tour by a single female solo artist at that time. 2008-present: Las Vegas residency, Burlesque, and album comeback: Cher returned to the stage on May 6, 2008, beginning a $60 million-dollar, 200-performance, three-year residency at Caesars Palace in Las Vegas. The show ran until February 5, 2011. It featured eighteen dancers, four aerialists and multiple costumes designed by Bob Mackie. In it, the star performed hits including Believe, If I Could Turn Back Time and After All. During her time at Caesars Palace, the star made her return to the big screen in the 2010 musical, Burlesque. She recorded two new songs for the picture, Welcome To Burlesque and the Diane Warren-written ballad You Haven't Seen The Last Of Me. The latter won the Golden Globe Award for Best Original Song and become a number one hit on the US dance charts. This made her the only female performer to achieve a number one on a Billboard chart in six consecutive decades. She also lent her voice to the 2011 comedy Zookeeper. Promoting her Las Vegas residency on The Ellen DeGeneres Show, she spoke of an as-yet incomplete movie project called The Drop-Out and voiced her support for Barack Obama's candidacy for president. On April 18, 2010, she made a surprise appearance at the Academy of Country Music (ACM) Awards, stating that the very first song she learned was \"Hey Good Lookin'.\" In 2010, Cher was honored with Glamour Magazine's Woman of the Year Lifetime Achievement Award, and on 18 November, 2010, was immortalized by placing her handprints and footprints in cement outside Grauman's Chinese Theatre in Hollywood. Cher received much attention when she presented Lady Gaga with the award for Video of the Year at the 2010 MTV Video Music Awards. She wore an outfit based on that worn in her music video for If I Could Turn Back Time, while Gaga wore a dress made out of cuts of meat. As of 2011, Cher is recording her first studio album since Living Proof in 2001. She initially talked of recording a rock album in Nashville, leading to speculation that it would be country-oriented. Cher has since stated on Twitter that the record will be \"way dance\". Lady Gaga has provided a song for the album, entitled The Greatest Thing, recorded as a duet between the two singers. The singer has also tweeted of the possibility of embarking on a comeback tour to promote the album in 2012. Personal life, Relationships: Cher had a relationship with actor Warren Beatty in the early 1960s.Sonny Bono and Cher first met in 1962. They claimed to have been married as early as 1963, and had a wedding ceremony in Tijuana, Mexico on October 27, 1964. Their only child is Chaz Bono, previously named Chastity Bono, born on March 4, 1969. After 13 years together, Sonny and Cher divorced on June 27, 1975. The divorce resulted in the cancellation of The Sonny and Cher Comedy Hour. Later that year Cher married rock and blues musician Gregg Allman. Their son Elijah Blue Allman (of the band Deadsy) was born on July 10, 1976. They separated after two years and finalized their divorce in 1979. Between Bono and Allman, Cher revealed that she had a fling with Elvis Presley while they were performing in Las Vegas, but rejected him when he asked her up to his room because she was nervous about spending the night with him. In February 2008, Cher stated on Good Morning America that she deeply regrets turning him down. In the interview, she also claimed to have been asked out by Marlon Brando during a plane ride. Cher was also involved with record executive David Geffen, KISS bassist Gene Simmons, and senior account manager Garreth Crawford. Throughout the 1980s, Cher dated several younger men including actors Tom Cruise and Val Kilmer, film producer Josh Donen, and Rob Camilletti, the 22-year-old bagel baker whom she met on her 40th birthday and lived with for three years. \" My relationships usually last a few years. When I'm involved with a man, other men are fascinated with me, but the minute I'm single again, half of those men disappear because they don't have the balls to really want me. \" --Cher - NME - April 1984, Cher was involved with Bon Jovi guitarist Richie Sambora for two years in the early 1990s, and was also linked to musicians Eric Clapton and Mark Hudson. In 2009, Cher dated 38 year-old biker Tim Medvetz. As of 2010, Cher is dating the American comedy writer Ron Zimmerman. They were first seen together in public in August 2010, having been dating for around six months. Personal wealth: Cher owns several pieces of real estate, including homes in Aspen, Colorado, US, and London, UK, and maintains a home in Malibu, California, US, which she listed for sale in 2008 at $45 million. In April 2006, it was reported that Cher had purchased a condominium in the Sierra Towers in West Hollywood, California, for $3.5 million. In 2002 her personal wealth was reported to be estimated at $600m (£315m). In July 2006, it was announced that Cher, in conjunction with Sotheby's and Julien's Auctions, was planning to auction about 800 of her personal possessions from her Italian Renaissance-themed Malibu estate, including numerous antiques, art collectibles, paintings, career memorabilia, furniture (including her bed) as well as numerous pieces of jewelry, clothing, stage costumes, gowns, a 2003 Hummer H2 and her 2005 Bentley. The event, which took place October 3-5, 2006, in Beverly Hills, California, raised $3.3 million. Cher had said a large percentage of the proceeds will benefit the Cher Charitable Foundation. Cher reportedly received $180 million for mounting her comeback at Caesars Palace in Las Vegas. As a gay icon: The reverence held for Cher by members of the gay community has been attributed to her accomplishments in her career, her sense of style and her longevity. Alec Mapa of The Advocate elaborates: \"While the rest of us were sleeping, Cher's been out there for the last four decades living out every single one of our childhood fantasies...Cher embodies an unapologetic freedom and fearlessness that some of us can only aspire to.\" Cher has often been imitated by drag queens. Thomas Rogers of Salon magazine commented that \"drag queens imitate women like Judy Garland, Dolly Parton and Cher because they overcame insult and hardship on their path to success, and because their narratives mirror the pain that many gay men suffer on their way out of the closet.\" Cher's performance as a lesbian in the film Silkwood as well as her transition to dance music and social activism in recent years has further contributed to her becoming a gay icon. Her child, Chaz Bono, who was born female, first came out as a lesbian at the age of seventeen, which caused Cher feelings of \"guilt, fear and pain\". However, Cher soon came to accept Chaz's sexual orientation, and came to the conclusion that LGBT people \"didn't have the same rights as everyone else, and she thought that was unfair\". She was the keynote speaker for the 1997 national Parents, Families, & Friends of Lesbians and Gays (PFLAG) convention. Cher has since become one of the gay community's most vocal advocates. As of June 11, 2009, Chaz Bono came out as a transgender individual, and his transition to male was legally finalized on May 7, 2010. In 1998, Cher was honored with a GLAAD Media Award (Gay and Lesbian Alliance Against Defamation) and in November 1999, The Advocate named Cher as one of the '25 Coolest Women'. In October 2005 the Bravo program Great Things About Being... declared Cher \"the number one greatest thing about being gay.\" William J. Mann, author of Gay Pride: A Celebration of All Things Gay and Lesbian, comments \"we'll be dancing to a ninety-year-old Cher when we're sixty. Just watch\", and in a 2007 'Top Ten Gay Icons', formed by Digital Spy, it was stated that: \"US comedian Jimmy James was spot-on when he quipped: \"After a nuclear holocaust, all that will be left are cockroaches and Cher\".\" The NBC sitcom Will & Grace acknowledged her status by making her the idol of gay character Jack McFarland. Cher guest-starred as herself twice on the sitcom, in 2000 and 2002. In 2000, Cher made a cameo on the show, in which Jack believed her to be a drag queen, and said he could \"do\" a better Cher himself. In 2002, she portrayed God in Jack's imagined version of Heaven. Political interests: Unlike her late ex-husband Sonny Bono, Cher has always been a staunch Democrat. She has attended and performed at Democratic Party conventions and events. Today, she considers herself a Democrat by default, but more of an Independent. Cher has always defined herself as an anti-war activist; she demonstrated against the Vietnam War, and the video for \"Turn Back Time\" in 1989 was sometimes interpreted as an admonition against the army: \"Make love, not war.\" On October 27, 2003, Cher anonymously called a C-SPAN phone-in program. She recounted a visit she had made to maimed soldiers at the Walter Reed Army Medical Center and criticized the lack of media coverage and government attention given to injured servicemen. She also remarked that she watches C-SPAN every day. Though she simply identified herself as an unnamed entertainer with the USO, she was recognized by the C-SPAN host, who subsequently questioned her about her 1992 support for independent presidential candidate Ross Perot. Back from her last tour in Europe, Cher declared that Europeans had a very bad image of Americans, mostly because of the Bush administration. \"Europeans see us as the real terrorists since this stupid war in Iraq and because of all the innocent civilians that were killed within the first ...somehow they're right.\" She shared the stage with Muhammad Muhammad in N.Y.C, an American actor who used to tell stories about the changes in American Muslims' lives since 9/11. On Memorial Day weekend in 2006, Cher called in again, endorsing Operation Helmet, an organization started by a doctor that provides helmet upgrade kits free of charge to troops in Iraq and Afghanistan, as well as to those ordered to deploy in the near future. She identified herself as a caller from Malibu, California, and proceeded to complain about the current presidential administration. She read aloud a letter from a soldier on the ground in Iraq, praising Operation Helmet's efforts, and decrying the lack of protection afforded by the military's provisions for troops. Cher appeared on The Ed Schultz Show in May 2006 to discuss her work in support of US troops fighting abroad, as well as returning veterans. Schultz noted her involvement with both Operation Helmet and the Intrepid Fallen Heroes Fund, which is constructing an advanced training skills facility at Brooke Army Medical Center in San Antonio, Texas. The center will serve military personnel who have been catastrophically disabled in operations in Iraq and Afghanistan, and those severely injured in other operations, as well as in the normal performance of their duties, combat and non-combat related. During the interview with Schultz, Cher again said she is an independent. Her comments about the current political scene in the US led him to interject, \"You're fed up with everybody\", to which she replied, \"I really am. I couldn't be a Republican 'cause I think I believe in too many services for poor people, but I'm fed up with the Democrats. I just think...you're gonna find all their spines where you find the elephant's graveyard.\" Toward the end of the interview, Schultz asked Cher what she thinks about today's protest songs. She responded, \"You know, I think it's the duty of artists to say what they want, in favor or in opposition. Unfortunately, I think that, with the Bush administration, you haven't been able to really voice any opposition because of 9/11, if you say anything opposed to the administration, somehow they've been able to wrap themselves in the flag, so that if you have any opposing viewpoint, you're unpatriotic.\" She was about to offer her thoughts on this, but stopped, saying, \"I don't know what you can say on your program, so I won't talk the way I normally talk. I don't like it...it rubs me the wrong way. And if I could say all those seven words,\" referring to George Carlin's Seven dirty words routine about profane language, \"that's what I'd be saying.\" Cher supported Hillary Clinton in her Presidential campaign, as she noted on Entertainment Tonight in February 2008. Clinton, in return, said she was thrilled to have Cher's support. After Barack Obama won the Democratic nomination, Cher supported his candidacy on radio and TV programs, including a November 3 appearance on The Ellen DeGeneres Show. Cher is still involved with Operation Helmet, and appeared with Dr. Bob Meaders (founder of Operation Helmet) on C-SPAN again on June 14, 2006. She then appeared with him on Capitol Hill on June 15, 2006. It has been reported that Cher has so far donated over US$130,000 to Operation Helmet. Humanitarian work: Cher said in 2010, \"I've played around with Buddhism for years.\" She is a devotee of Pema Chödrön, an American Buddhist nun. Cher has been involved with many humanitarian groups and charity efforts over the years. After appearing in the movie Mask, she served as National Chairperson and Honorary Spokesperson of the Children's Craniofacial Association. Over the years while touring, she frequently donated concert tickets to families and non-profit groups for children and youth with facial deformities. In 1998, she co-hosted the annual Amfar AIDS Benefit at the Cannes Film Festival with Elizabeth Taylor. She is also the namesake of the Cher Charitable Foundation, which donates funds to various charities and causes close to her heart. In 1993, Cher participated in a humanitarian effort to Armenia (her father was the child of Armenian refugees), bringing much needed food and medical supplies. Fan base: Cher has a very large and devoted fan base. Their devotion is evidenced through the biennial Cher Convention that began in Chicago in 2000 when her song \"Believe\" reached number one. The event was held in Las Vegas in 2002 and 2004, Los Angeles in 2006, and in 2008 at Caesars Palace in Las Vegas, Nevada. The Las Vegas convention coincided with the beginning of Cher's second run at Caesars Colosseum. All convention proceeds went to the Children's Craniofacial Association, a 501(c)3, for which Cher is the National Spokesperson. The Cher Expo, a biennial event that began in 2007, brings Cher fans together for a two-night, one-day event. All expo proceeds go to a non-profit charity. The 2009 Cher Expo in Atlanta, Georgia, will benefit \"Keep a Child Alive.\" Legacy, In her early career Cher was a fashion trend-setter, popularizing long straight hair, bell-bottoms and an exposed midriff. She is noted as being one of the first females to expose her bellybutton on television. Through her 1970s television shows she became a sex symbol and pushed the censors with her revealing outfits and creative ensembles, frequently designed by Bob Mackie. In 1989 she boarded the U.S. Navy's USS Missouri ship in thong and fishnets for the \"If I Could Turn Back Time\" music video, becoming one of the first videos by a mainstream pop artist to be banned by MTV (after the video was banned, it grew to mass popularity, causing MTV to play the video, though after 9 p.m.). In July 1999, Cher ranked 43rd on VH1's 100 Greatest Women of Rock & Roll poll and in September 2002 ranked 26th on VH1's 100 Sexiest Artists. She has appeared on the cover of People magazine thirteen times. In a 2007 poll, A&E's Biography magazine ranked her as the third favorite actress of all time behind two of her Hollywood idols, Katharine Hepburn and Audrey Hepburn. She has inspired many celebrities who have noted her as being a major influence on them, such as Britney Spears,Tracy Chapman,Oprah Winfrey, Christina Aguilera, Cyndi Lauper, Gene Simmons, Meryl Streep, Anastacia, Rosie O'Donnell and Lady Gaga.", "site": "wikipedia", "url": "http://en.wikipedia.org/wiki/Cher", "license": {"type": "cc-by-sa", "attribution": "wikipedia", "attribution-url": "http://en.wikipedia.org/wiki/Cher", "url": "http://creativecommons.org/licenses/by-sa/3.0/", "version": "3.0"}}, {"text": "17 year old Cher mesmerised The X Factor 2010 audiences ...", "site": "facebook", "url": "http://www.facebook.com/cherlloydmusic", "license": {"type": "unknown", "attribution": "facebook", "attribution-url": "http://www.facebook.com/cherlloydmusic", "url": "n/a", "version": "unknown"}, "truncated": true}, {"text": "Cher has had three careers that place her indelibly in ...", "site": "amazon", "url": "http://www.amazon.com/Cher/e/B000APVS9M/", "license": {"type": "unknown", "attribution": "amazon", "attribution-url": "http://www.amazon.com/Cher/e/B000APVS9M/", "url": "n/a", "version": "unknown"}, "truncated": true}]}}